app/controllers/customers_controller.rb

  def show
    @customer = Customer.find(params[:id])
---
SELECT * FROM [Customers] WHERE ([Customers].[CustomerID] = 'ALFKI')

  def edit
    @customer = Customer.find(params[:id])
---
SELECT * FROM [Customers] WHERE ([Customers].[CustomerID] = 'ALFKI')

  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save
---
INSERT INTO [Customers] ([ContactName], [City], [ContactTitle], [Region], [Phone], [CustomerID], [Country], [PostalCode], [Fax], [CompanyName], [Address]) VALUES('Chris Johnson', 'Madison', 'Developer', 'Midwest', '608.320.5190', 'MYTES', NULL, '53523', '608.661.7701', 'My Test Company', '3001 W. Beltline HWY')